INSERT INTO purchase_info (id, age, amount, count, first_name, last_name, purchase_date, purchase_item)
VALUES
    (1, 18, 100.0, 1, 'Иван', 'Иванов', '2024-03-19', 'HEADPHONES'),
    (2, 18, 100.0, 1, 'Александр', 'Александров', '2024-03-26', 'SMARTPHONE'),
    (3, 19, 100.0, 1, 'Иван', 'Иванов', '2024-04-02', 'HEADPHONES'),
    (4, 19, 100.0, 1, 'Александр', 'Александров', '2024-04-09', 'SMARTPHONE'),
    (5, 21, 150.0, 1, 'Петр', 'Петров', '2024-04-16', 'HEADPHONES'),
    (6, 21, 150.0, 1, 'Максим', 'Максимов', '2024-04-23', 'SMARTPHONE'),
    (7, 23, 200.0, 1, 'Сидор', 'Сидоров', '2024-04-30', 'HEADPHONES'),
    (8, 23, 200.0, 1, 'Артем', 'Артемов', '2024-05-07', 'SMARTPHONE'),
    (9, 25, 250.0, 1, 'Николай', 'Николаев', '2024-05-14', 'HEADPHONES'),
    (10, 25, 250.0, 1, 'Тимур', 'Тимуров', '2024-05-21', 'SMARTPHONE'),
    (11, 27, 300.0, 1, 'Игорь', 'Игорев', '2024-05-28', 'HEADPHONES'),
    (12, 27, 300.0, 1, 'Василий', 'Васильев', '2024-06-04', 'SMARTPHONE'),
    (13, 29, 350.0, 1, 'Евгений', 'Евгенов', '2024-06-11', 'HEADPHONES'),
    (14, 29, 350.0, 1, 'Федор', 'Федоров', '2024-06-18', 'SMARTPHONE'),
    (15, 31, 400.0, 1, 'Дмитрий', 'Дмитриев', '2024-06-25', 'HEADPHONES'),
    (16, 31, 400.0, 1, 'Антон', 'Антонов', '2024-07-02', 'SMARTPHONE'),
    (17, 33, 450.0, 1, 'Алексей', 'Алексеев', '2024-07-09', 'HEADPHONES'),
    (18, 33, 450.0, 1, 'Степан', 'Степанов', '2024-07-16', 'SMARTPHONE'),
    (19, 35, 500.0, 1, 'Андрей', 'Андреев', '2024-07-23', 'HEADPHONES'),
    (20, 35, 500.0, 1, 'Петр', 'Петров', '2024-07-30', 'SMARTPHONE'),
    (21, 37, 550.0, 1, 'Сергей', 'Сергеев', '2024-08-06', 'HEADPHONES'),
    (22, 37, 550.0, 1, 'Егор', 'Егоров', '2024-08-13', 'SMARTPHONE'),
    (23, 39, 600.0, 1, 'Борис', 'Борисов', '2024-08-20', 'HEADPHONES'),
    (24, 39, 600.0, 1, 'Матвей', 'Матвеев', '2024-08-27', 'SMARTPHONE'),
    (25, 41, 650.0, 1, 'Павел', 'Павлов', '2024-09-03', 'HEADPHONES'),
    (26, 41, 650.0, 1, 'Илья', 'Ильин', '2024-09-10', 'SMARTPHONE'),
    (27, 43, 700.0, 1, 'Михаил', 'Михайлов', '2024-09-17', 'HEADPHONES'),
    (28, 43, 700.0, 1, 'Даниил', 'Даниилов', '2024-09-24', 'SMARTPHONE'),
    (29, 45, 750.0, 1, 'Владимир', 'Владимиров', '2024-10-01', 'HEADPHONES'),
    (30, 18, 100.0, 1, 'Александр', 'Александров', '2024-03-26', 'SMARTPHONE')

-- SELECT p.purchase_item, COUNT(p.purchase_item) AS count
-- FROM purchase_info p
-- WHERE p.purchase_date BETWEEN :startDate AND :endDate
-- GROUP BY p.purchase_item
-- ORDER BY count DESC
--     LIMIT 1;
--
-- SELECT p.purchase_item, COUNT(p.purchase_item) AS count
-- FROM purchase_info p
-- WHERE p.age = 18
-- GROUP BY p.purchase_item
-- ORDER BY count DESC
--     LIMIT 1